{
    "format": "layers-model",
    "generatedBy": "keras v2.15.0",
    "convertedBy": "TensorFlow.js Converter v4.15.0",
    "modelTopology": {
        "keras_version": "2.15.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                8
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "dense_input"
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "batch_input_shape": [
                                null,
                                8
                            ],
                            "units": 12,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_1",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 8,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_2",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 8,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense_3",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 3,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": {
                "class_name": "SparseCategoricalCrossentropy",
                "config": {
                    "reduction": "auto",
                    "name": "sparse_categorical_crossentropy",
                    "from_logits": false,
                    "ignore_class": null,
                    "fn": "sparse_categorical_crossentropy"
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "sparse_categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "Custom>AdamW",
                "config": {
                    "name": "AdamW",
                    "weight_decay": 0.004,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "jit_compile": false,
                    "is_legacy_optimizer": false,
                    "learning_rate": 0.0010000000474974513,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [
                        8,
                        12
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.64579745016846,
                        "scale": 0.006797867896510106,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        12
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.09475361637625039,
                        "scale": 0.0011416098358584385,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_1/kernel",
                    "shape": [
                        12,
                        8
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.5708243762745577,
                        "scale": 0.004603422389310949,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_1/bias",
                    "shape": [
                        8
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.08763112425804138,
                        "scale": 0.0012886930037947263,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_2/kernel",
                    "shape": [
                        8,
                        8
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.8197664232815014,
                        "scale": 0.0062103516915265255,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_2/bias",
                    "shape": [
                        8
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.04533957178686179,
                        "scale": 0.0009067914357372359,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_3/kernel",
                    "shape": [
                        8,
                        3
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.922013990318074,
                        "scale": 0.006932436017429128,
                        "original_dtype": "float32"
                    }
                },
                {
                    "name": "dense_3/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32",
                    "quantization": {
                        "dtype": "uint8",
                        "min": -0.029882358109541967,
                        "scale": 0.0005638180775385277,
                        "original_dtype": "float32"
                    }
                }
            ]
        }
    ]
}